#pragma once

//===============================================
// 型エイリアス
//===============================================
#include "Definition/Type/TypeDEF.h"

//===============================================
// シングルトンを安全に扱うためのクラス
//===============================================
#include "Singleton/SingletonBase.h"

//=========================================================
// ファイル読み込み、書き込み用便利関数
//=========================================================
#include "Utility/FileIO/FileIOUtility.h"

//=========================================================
// 文字列変換便利関数
//=========================================================
#include "Utility/String/StringUtility.h"

//===============================================
// 定義、定数
//===============================================
#include "Definition/Constant/CommonConstant.h"
#include "Definition/Struct/CommonStruct.h"

//=========================================================
// 静的型"ID"管理クラス
//=========================================================
#include "StaticID/StaticID.h"

//=========================================================
// 型情報定義、管理クラス及び便利関数
//=========================================================
#include "TypeInfo/TypeInfo.h"
#include "Utility/TypeInfo/TypeInfoUtility.h"
#include "TypeInfo/Registry/TypeInfoRegistry.h"

//=========================================================
// タグ構造体
//=========================================================
#include "Tag/TagBase.h"
#include "Tag/WindowStyle/WindowStyleTag.h"

//=========================================================
// 基底クラスから派生しているかチェックするコンセプト
//=========================================================
#include "Definition/Concept/IsDerivedBase/IsDerivedBaseConcept.h"
#include "Definition/Concept/IsDerivedBase/Tag/IsDerivedWindowStyleTagBaseConcept.h"

//=========================================================
// "Json"のシリアライズ、デシリアライズ補助関数
//=========================================================
#include "Utility/Json/JsonUtility.h"

//=========================================================
// "json"コンバータークラス
//=========================================================
#include "Converter/Json/JsonConverterBase.h"
#include "Converter/Json/FPS/FPSControllerJsonConverter.h"
#include "Converter/Json/Window/WindowJsonConverter.h"

//=========================================================
// "FPS"計測クラス
//=========================================================
#include "FPS/FPSController.h"

//=========================================================
// ウィンドウクラス
//=========================================================
#include "Window/Window.h"